[
  {
    "title": "Amid chill in ties, agencies working to tackle nexus of separatists, gangsters & terrorists",
    "content": "According to officials in the know, central intelligence agencies want to drive home two key points at the conference — the need to go after properties of those with Khalistani links, and better coordination with state police forces so leads can be pursued at the international stage."
  },
  {
    "title": "Govt launches study in India portal for international students",
    "content": "Education Minister Pradhan said that the portal is guided by the National Education Policy (NEP) 2020 and reflects the government’s commitment to make India a “preferred education destination as well as to blur academic boundaries for shaping a prosperous future”The government on Thursday launched the Study In India (SII) portal that will provide an integrated one-stop solution for student registration and visa application process.\n\nExternal affairs minister S Jaishankar and union education minister Dharmendra Pradhan launched the portal. (PIB photo)\n\nThe portal was launched by union external affairs minister S Jaishankar and union education minister Dharmendra Pradhan with an aim to establishing India as a global hub for education by welcoming students from diverse backgrounds.\n\nWhile addressing the gathering, Jaishankar said that the portal will help the country to establish a strong international footprint of brand India in the education sphere.\n\n“I note the integrated approach of the portal which enables user-friendly application processes for international students from registration to visa approval. This simplifies...their entire journey, facilitating the choice of desired courses and receiving offers from relevant institutions,” he said.\n\nHe further said that the presence of international students will also benefit the domestic students by connecting them more closely to a globalised world and prepare them better for the global workplace.\n\n“It will connect the students more closely, to the globalizing world and prepare them better for the global workplace. Having students from other countries studying with you creates a better understanding of their cultures, habits, traditions and even thinking,” the external affairs minister said.\n\n“When such students go back to their societies of origin, they truly become ambassadors of goodwill for India, sometimes even more so,” he added.\n\nEducation minister Pradhan said that the portal is guided by the National Education Policy (NEP) 2020 and reflects the government’s commitment to make India a “preferred education destination as well as to blur academic boundaries for shaping a prosperous future.”\n\n“With the vision of the Prime Minister Shri Narendra Modi of making education transcend geo-political boundaries, Study In India Portal is going to be a pivotal step in making India a preferred destination for higher education among students worldwide,” Pradhan added.\n\nThe Study in India or SII programme is a flagship project launched by the education ministry in 2018 with an aim to endorse India as a prime education hub for international students by inviting them to pursue higher education in the country and explore valuable educational opportunities enabled by top Indian universities.\n\nAccording to the education ministry, the portal is a dedicated website that will provide comprehensive information about the Indian Higher Education Institutions (HEIs). “The website will illustrate academic programs covering but not limited to undergraduate (UG), postgraduate (PG), Doctoral level programs as well as courses in Indian Knowledge System like Yoga, Ayurveda, classical arts etc,” the ministry said in a statement.\n\nIt will provide information about the academic facilities, research support, and related information, it added.\n\nGet Latest India News along with Latest News and Top Headlines from India and around the world",
    "url": "https://www.hindustantimes.com/india-news/government-launches-study-in-india-portal-to-establish-india-as-global-education-hub-101691069616859.html"
  }
]